In [1]:
import pandas as pd
import os
import json
import pymysql
from sqlalchemy import create_engine

In [2]:
os.environ['GIT_PYTHON_REFRESH']='quiet'
import git
from git.repo.base import Repo

In [3]:
# pushing source file into our local file
# github source path => https://github.com/PhonePe/Pulse.git
# local path => C:\Users\Windows 11\Downloads\pulse-master\pulse-master
# Repo.clone_from('https://github.com/PhonePe/pulse.git',r'C:\Users\Windows 11\Downloads\pulse-master\pulse-master')

# agg_trans_details

In [4]:
agg_trans_path = r"C:\Users\Windows 11\Downloads\pulse-master\pulse-master\data\aggregated\transaction\country\india\state"
agg_trans_list = os.listdir(agg_trans_path)

In [5]:
agg_trans_detail = {'State': [], 'Year': [], 'Quarter': [], 'Transaction_type': [], 
                    'Transaction_count': [],'Transaction_amount': []}
for state in agg_trans_list:
    cur_state = agg_trans_path +'/'+ state + "/"
    agg_year_trans = os.listdir(cur_state)
    
    for year in agg_year_trans:
        cur_year = cur_state + year + "/"
        agg_file_trans = os.listdir(cur_year)
        
        for file in agg_file_trans:
            cur_file = cur_year + file
            data = open(cur_file, 'r')
            A = json.load(data)
            
            for i in A['data']['transactionData']:
                name = i['name']
                count = i['paymentInstruments'][0]['count']
                amount = i['paymentInstruments'][0]['amount']
                agg_trans_detail['Transaction_type'].append(name)
                agg_trans_detail['Transaction_count'].append(count)
                agg_trans_detail['Transaction_amount'].append(amount)
                agg_trans_detail['State'].append(state)
                agg_trans_detail['Year'].append(int(year))
                agg_trans_detail['Quarter'].append(int(file.strip('.json')))
                
df_agg_trans = pd.DataFrame(agg_trans_detail)

In [6]:
df_agg_trans.head()

,State,Year,Quarter,Transaction_type,Transaction_count,Transaction_amount
0,andaman-&-nicobar-islands,2018,1,Recharge & bill payments,4200,1.845307e+06
1,andaman-&-nicobar-islands,2018,1,Peer-to-peer payments,1871,1.213866e+07
2,andaman-&-nicobar-islands,2018,1,Merchant payments,298,4.525072e+05
3,andaman-&-nicobar-islands,2018,1,Financial Services,33,1.060142e+04
4,andaman-&-nicobar-islands,2018,1,Others,256,1.846899e+05

In [7]:
df_agg_trans.shape

(3954, 6)

In [8]:
df_agg_trans.dtypes

State                  object
Year                    int64
Quarter                 int64
Transaction_type       object
Transaction_count       int64
Transaction_amount    float64
dtype: object

# agg_user_details

In [9]:
agg_user_path = r"C:\Users\Windows 11\Downloads\pulse-master\pulse-master\data\aggregated\user\country\india\state"
agg_user_list = os.listdir(agg_user_path)

In [10]:
agg_user_detail = {'State':[],'Year':[],'Quarter':[],'Brand':[],'User_Count':[],'User_Percentage':[]}

for state in agg_user_list:
    cur_state = agg_user_path+'/'+state+'/'
    agg_year_user = os.listdir(cur_state)
    
    for year in agg_year_user:
        cur_year = cur_state+year+'/'
        agg_file_user = os.listdir(cur_year)
        
        for file in agg_file_user:
            cur_file = cur_year+file
            data = open(cur_file,'r')
            B = json.load(data)
            
            try:
                for i in B['data']['usersByDevice']:
                    brand = i['brand']
                    count = i['count']
                    percent = i['percentage']
                    agg_user_detail['Brand'].append(brand)
                    agg_user_detail['User_Count'].append(count)
                    agg_user_detail['User_Percentage'].append(percent)
                    agg_user_detail['State'].append(state)
                    agg_user_detail['Year'].append(int(year))
                    agg_user_detail['Quarter'].append(int(file.strip('.json')))
            except:
                pass
        # we use try expect method for reason some data value is None 
df_agg_user = pd.DataFrame(agg_user_detail)

In [11]:
df_agg_user

,State,Year,Quarter,Brand,User_Count,User_Percentage
0,andaman-&-nicobar-islands,2018,1,Xiaomi,1665,0.247033
1,andaman-&-nicobar-islands,2018,1,Samsung,1445,0.214392
2,andaman-&-nicobar-islands,2018,1,Vivo,982,0.145697
3,andaman-&-nicobar-islands,2018,1,Oppo,501,0.074332
4,andaman-&-nicobar-islands,2018,1,OnePlus,332,0.049258
...,...,...,...,...,...,...
6727,west-bengal,2022,1,Lenovo,330017,0.015056
6728,west-bengal,2022,1,Infinix,284678,0.012987
6729,west-bengal,2022,1,Asus,280347,0.012790
6730,west-bengal,2022,1,Apple,277752,0.012671
6731,west-bengal,2022,1,Others,2196334,0.100199

In [12]:
df_agg_user.shape

(6732, 6)

In [13]:
df_agg_user.dtypes

State               object
Year                 int64
Quarter              int64
Brand               object
User_Count           int64
User_Percentage    float64
dtype: object

# map_trans_details

In [14]:
map_trans_path =r"C:\Users\Windows 11\Downloads\pulse-master\pulse-master\data\map\transaction\hover\country\india\state"
map_trans_list = os.listdir(map_trans_path)

In [15]:
map_trans_detail= {'State':[],'Year':[],'Quarter':[],'District':[],'Transaction_Count':[],'Transaction_Amount':[]}

for state in map_trans_list:
    cur_state = map_trans_path+'/'+state+'/'
    map_year_trans = os.listdir(cur_state)
    
    for year in map_year_trans:
        cur_year = cur_state+year+'/'
        map_file_trans = os.listdir(cur_year)
        
        for file in map_file_trans:
            cur_file = cur_year+file
            data = open(cur_file,'r')
            C = json.load(data)
            
            for i in C['data']['hoverDataList']:
                district = i['name']
                count = i['metric'][0]['count']
                amount = i['metric'][0]['amount']
                map_trans_detail['District'].append(district)
                map_trans_detail['Transaction_Count'].append(count)
                map_trans_detail['Transaction_Amount'].append(amount)
                map_trans_detail['State'].append(state)
                map_trans_detail['Year'].append(int(year))
                map_trans_detail['Quarter'].append(int(file.strip('.json')))
                
df_map_trans = pd.DataFrame(map_trans_detail)

In [16]:
df_map_trans

,State,Year,Quarter,District,Transaction_Count,Transaction_Amount
0,andaman-&-nicobar-islands,2018,1,north and middle andaman district,442,9.316631e+05
1,andaman-&-nicobar-islands,2018,1,south andaman district,5688,1.256025e+07
2,andaman-&-nicobar-islands,2018,1,nicobars district,528,1.139849e+06
3,andaman-&-nicobar-islands,2018,2,north and middle andaman district,825,1.317863e+06
4,andaman-&-nicobar-islands,2018,2,south andaman district,9395,2.394824e+07
...,...,...,...,...,...,...
16095,west-bengal,2023,2,nadia district,26194658,5.410386e+10
16096,west-bengal,2023,2,birbhum district,14912523,2.941312e+10
16097,west-bengal,2023,2,purba medinipur district,30724502,6.595899e+10
16098,west-bengal,2023,2,maldah district,24677357,5.218621e+10
16099,west-bengal,2023,2,darjiling district,13049366,2.372866e+10

In [17]:
dd = df_map_trans[["State","District"]]
dd

                           State                           District
0      andaman-&-nicobar-islands  north and middle andaman district
1      andaman-&-nicobar-islands             south andaman district
2      andaman-&-nicobar-islands                  nicobars district
3      andaman-&-nicobar-islands  north and middle andaman district
4      andaman-&-nicobar-islands             south andaman district
...                          ...                                ...
16095                west-bengal                     nadia district
16096                west-bengal                   birbhum district
16097                west-bengal           purba medinipur district
16098                west-bengal                    maldah district
16099                west-bengal                 darjiling district

[16100 rows x 2 columns]

In [18]:
df_map_trans.shape

(16100, 6)

In [19]:
df_map_trans.dtypes

State                  object
Year                    int64
Quarter                 int64
District               object
Transaction_Count       int64
Transaction_Amount    float64
dtype: object

# map_user_details

In [20]:
map_user_path =r"C:\Users\Windows 11\Downloads\pulse-master\pulse-master\data\map\user\hover\country\india\state"
map_user_list = os.listdir(map_user_path)

In [21]:
map_user_detail = {'State':[],'Year':[],'Quarter':[],'District':[],'RegisteredUsers':[],'Appopens':[]}

for state in map_user_list:
    cur_state = map_user_path+'/'+state+'/'
    map_year_user = os.listdir(cur_state)
    
    for year in map_year_user:
        cur_year = cur_state+year+'/'       
        map_file_user = os.listdir(cur_year)
        
        for file in map_file_user:
            cur_file = cur_year+file
            data = open(cur_file,'r')
            D = json.load(data)
            
            for i in D['data']['hoverData'].items():
                district = i[0]
                users = i[1]['registeredUsers']
                appopens = i[1]['appOpens']
                map_user_detail['State'].append(state)
                map_user_detail['Year'].append(int(year))
                map_user_detail['Quarter'].append(int(file.strip('.json')))
                map_user_detail['District'].append(district)
                map_user_detail['RegisteredUsers'].append(users)
                map_user_detail['Appopens'].append(appopens)
                
df_map_user = pd.DataFrame(map_user_detail)

In [22]:
df_map_user

,State,Year,Quarter,District,RegisteredUsers,Appopens
0,andaman-&-nicobar-islands,2018,1,north and middle andaman district,632,0
1,andaman-&-nicobar-islands,2018,1,south andaman district,5846,0
2,andaman-&-nicobar-islands,2018,1,nicobars district,262,0
3,andaman-&-nicobar-islands,2018,2,north and middle andaman district,911,0
4,andaman-&-nicobar-islands,2018,2,south andaman district,8143,0
...,...,...,...,...,...,...
16099,west-bengal,2023,2,nadia district,1482400,9509833
16100,west-bengal,2023,2,birbhum district,934943,12789154
16101,west-bengal,2023,2,purba medinipur district,1468608,12096564
16102,west-bengal,2023,2,maldah district,1046132,17662446
16103,west-bengal,2023,2,darjiling district,613398,15141713

In [23]:
df_map_user.shape

(16104, 6)

In [24]:
df_map_user.dtypes

State              object
Year                int64
Quarter             int64
District           object
RegisteredUsers     int64
Appopens            int64
dtype: object

# top_trans_details

In [25]:
top_trans_path = r"C:\Users\Windows 11\Downloads\pulse-master\pulse-master\data\top\transaction\country\india\state"
top_trans_list = os.listdir(top_trans_path)

In [26]:
top_user_detail = {'State': [], 'Year': [], 'Quarter': [], 'Pincode': [], 'Transaction_count': [],
            'Transaction_amount': []}

for state in top_trans_list:
    cur_state = top_trans_path + '/'+state + "/"
    top_year_trans = os.listdir(cur_state)
    
    for year in top_year_trans:
        cur_year = cur_state + year + "/"
        top_file_trans = os.listdir(cur_year)
        
        for file in top_file_trans:
            cur_file = cur_year + file
            data = open(cur_file, 'r')
            E = json.load(data)
            
            for i in E['data']['pincodes']:
                name = i['entityName']
                count = i['metric']['count']
                amount = i['metric']['amount']
                top_user_detail['Pincode'].append(name)
                top_user_detail['Transaction_count'].append(count)
                top_user_detail['Transaction_amount'].append(amount)
                top_user_detail['State'].append(state)
                top_user_detail['Year'].append(int(year))
                top_user_detail['Quarter'].append(int(file.strip('.json')))
df_top_trans = pd.DataFrame(top_user_detail)

In [27]:
df_top_trans

,State,Year,Quarter,Pincode,Transaction_count,Transaction_amount
0,andaman-&-nicobar-islands,2018,1,744101,1622,2.769298e+06
1,andaman-&-nicobar-islands,2018,1,744103,1223,2.238042e+06
2,andaman-&-nicobar-islands,2018,1,744102,969,3.519060e+06
3,andaman-&-nicobar-islands,2018,1,744105,685,1.298561e+06
4,andaman-&-nicobar-islands,2018,1,744104,340,1.039715e+06
...,...,...,...,...,...,...
7848,west-bengal,2023,2,700001,2918444,6.259877e+09
7849,west-bengal,2023,2,721301,2910870,4.458107e+09
7850,west-bengal,2023,2,700039,2886562,4.662887e+09
7851,west-bengal,2023,2,700015,2774383,4.372975e+09
7852,west-bengal,2023,2,700014,2757479,5.108638e+09

In [28]:
df_top_trans.shape

(7853, 6)

In [29]:
df_top_trans.dtypes

State                  object
Year                    int64
Quarter                 int64
Pincode                object
Transaction_count       int64
Transaction_amount    float64
dtype: object

# top_user_details

In [30]:
top_user_path = r"C:\Users\Windows 11\Downloads\pulse-master\pulse-master\data\top\user\country\india\state"
top_user_list = os.listdir(top_user_path)

In [31]:
top_user_detail = {'State':[],'Year':[],'Quarter':[],'Pincode':[],'RegisteredUsers':[]}

for state in top_user_list:
    cur_state = top_user_path+'/'+state+'/'
    top_year_user = os.listdir(cur_state)
    
    for year in top_year_user:
        cur_year = cur_state+year+'/'
        top_file_user = os.listdir(cur_year)
        
        for file in top_file_user:
            cur_file = cur_year+file
            data = open(cur_file,'r')
            F = json.load(data)
            
            
            for i in F['data']['pincodes']:
                name = i['name']
                registeredUsers = i['registeredUsers']
                top_user_detail['Pincode'].append(name)
                top_user_detail['RegisteredUsers'].append(registeredUsers)
                top_user_detail['State'].append(state)
                top_user_detail['Year'].append(int(year))
                top_user_detail['Quarter'].append(int(file.strip('.json')))
df_top_user = pd.DataFrame(top_user_detail)

In [32]:
df_top_user

                          State  Year  Quarter Pincode  RegisteredUsers
0     andaman-&-nicobar-islands  2018        1  744103             1608
1     andaman-&-nicobar-islands  2018        1  744101             1108
2     andaman-&-nicobar-islands  2018        1  744105             1075
3     andaman-&-nicobar-islands  2018        1  744102             1006
4     andaman-&-nicobar-islands  2018        1  744104              272
...                         ...   ...      ...     ...              ...
7849                west-bengal  2023        2  700015           117690
7850                west-bengal  2023        2  742304           114746
7851                west-bengal  2023        2  721101           114293
7852                west-bengal  2023        2  700150           110694
7853                west-bengal  2023        2  700091           110637

[7854 rows x 5 columns]

In [33]:
df_top_user.shape

(7854, 5)

In [34]:
df_top_user.dtypes

State              object
Year                int64
Quarter             int64
Pincode            object
RegisteredUsers     int64
dtype: object

# india overall data

## agg_overall_trans_details

In [35]:
agg_trans_india = r'C:\Users\Windows 11\Downloads\pulse-master\pulse-master\data\aggregated\transaction\country\india'
agg_trans_ind_list = os.listdir(agg_trans_india)
agg_trans_ind_list.remove("state")
agg_trans_ind_list

['2018', '2019', '2020', '2021', '2022', '2023']

In [36]:
agg_oat = {'Year': [], 'Quarter': [], 'Transaction_type': [], 'Transaction_count': [],'Transaction_amount': []}

for year in agg_trans_ind_list:
    cur_year = agg_trans_india +'/'+year + "/"
    year_trans = os.listdir(cur_year)
    
    for file in year_trans:
        cur_file = cur_year+file
        data = open(cur_file,'r')
        G = json.load(data)
        
        for i in G['data']['transactionData']:
            name= i['name']
            count=i['paymentInstruments'][0]['count']
            amount = i['paymentInstruments'][0]['amount']
            agg_oat['Year'].append(int(year))
            agg_oat['Quarter'].append(int(file.strip('.json')))
            agg_oat['Transaction_type'].append(name)
            agg_oat['Transaction_count'].append(count)
            agg_oat['Transaction_amount'].append(amount)
            
df_agg_oat = pd.DataFrame(agg_oat)

In [37]:
df_agg_oat

,Year,Quarter,Transaction_type,Transaction_count,Transaction_amount
0,2018,1,Recharge & bill payments,72550406,1.447271e+10
1,2018,1,Peer-to-peer payments,46982705,1.472459e+11
2,2018,1,Merchant payments,5368669,4.656679e+09
3,2018,1,Financial Services,3762820,8.158531e+08
4,2018,1,Others,5761576,4.643217e+09
...,...,...,...,...,...
105,2023,2,Merchant payments,8529595637,4.277821e+12
106,2023,2,Peer-to-peer payments,5374546962,1.772278e+13
107,2023,2,Recharge & bill payments,1190947064,9.047589e+11
108,2023,2,Financial Services,5195942,6.364034e+09
109,2023,2,Others,9341245,6.919678e+09

In [38]:
df_agg_oat.shape

(110, 5)

In [39]:
df_agg_oat.dtypes

Year                    int64
Quarter                 int64
Transaction_type       object
Transaction_count       int64
Transaction_amount    float64
dtype: object

## agg_overall_user_details

In [40]:
agg_user_india = r'C:\Users\Windows 11\Downloads\pulse-master\pulse-master\data\aggregated\user\country\india'
agg_user_ind_list = os.listdir(agg_trans_india)
agg_user_ind_list.remove("state")
agg_user_ind_list

['2018', '2019', '2020', '2021', '2022', '2023']

In [41]:
agg_oau = {'Year':[],'Quarter':[],'Brand':[],'User_Count':[],'User_Percentage':[]}

for year in agg_user_ind_list:
    cur_year = agg_user_india +'/'+year + "/"
    year_trans = os.listdir(cur_year)
    
    for file in year_trans:
        cur_file = cur_year+file
        data = open(cur_file,'r')
        H= json.load(data)

        try:    
            for i in H['data']['usersByDevice']:
                brand = i['brand']
                count = i['count']
                percent = i['percentage']
                agg_oau['Brand'].append(brand)
                agg_oau['User_Count'].append(count)
                agg_oau['User_Percentage'].append(percent)
                agg_oau['Year'].append(int(year))
                agg_oau['Quarter'].append(int(file.strip('.json')))
        except:
            pass

df_agg_oau = pd.DataFrame(agg_oau)

In [42]:
df_agg_oau

     Year  Quarter     Brand  User_Count  User_Percentage
0    2018        1    Xiaomi    11926334         0.254413
1    2018        1   Samsung     9609401         0.204988
2    2018        1      Vivo     5894293         0.125737
3    2018        1      Oppo     4479351         0.095554
4    2018        1    Realme     2376866         0.050703
..    ...      ...       ...         ...              ...
182  2022        1   OnePlus     7974546         0.021382
183  2022        1  Motorola     5610140         0.015043
184  2022        1    Huawei     4882972         0.013093
185  2022        1     Tecno     4550078         0.012200
186  2022        1    Others    25835848         0.069274

[187 rows x 5 columns]

In [43]:
df_agg_oau.shape

(187, 5)

In [44]:
df_agg_oau.dtypes

Year                 int64
Quarter              int64
Brand               object
User_Count           int64
User_Percentage    float64
dtype: object

## map_overall_trans_details

In [45]:
map_trans_india = r'C:\Users\Windows 11\Downloads\pulse-master\pulse-master\data\map\transaction\hover\country\india'
map_trans_ind_list = os.listdir(map_trans_india)
map_trans_ind_list.remove("state")
map_trans_ind_list

['2018', '2019', '2020', '2021', '2022', '2023']

In [46]:
map_oat = {'Year':[],'Quarter':[],'State':[],'Transaction_count': [],'Transaction_amount': []}

for year in map_trans_ind_list:
    cur_year = map_trans_india +'/'+year + "/"
    year_trans = os.listdir(cur_year)
    
    for file in year_trans:
        cur_file = cur_year+file
        data = open(cur_file,'r')
        I= json.load(data)
        
        for i in I['data']['hoverDataList']:
            state = i['name']
            count = i['metric'][0]['count']
            amount = i['metric'][0]['amount']
            map_oat['State'].append(state)
            map_oat['Transaction_count'].append(count)
            map_oat['Transaction_amount'].append(amount)
            map_oat['Year'].append(int(year))
            map_oat['Quarter'].append(int(file.strip('.json')))
        
df_map_oam = pd.DataFrame(map_oat)

In [47]:
df_map_oam

     Year  Quarter              State  Transaction_count  Transaction_amount
0    2018        1         puducherry             104212        1.658260e+08
1    2018        1         tamil nadu            6726622        1.126156e+10
2    2018        1      uttar pradesh           12537805        1.393997e+10
3    2018        1     madhya pradesh            8025395        8.681603e+09
4    2018        1     andhra pradesh            9039585        1.199628e+10
..    ...      ...                ...                ...                 ...
787  2023        2    jammu & kashmir           54588299        7.653001e+10
788  2023        2                goa           26530590        3.841221e+10
789  2023        2  arunachal pradesh           10360488        1.980570e+10
790  2023        2              delhi          482138998        6.617285e+11
791  2023        2        uttarakhand          102758214        1.340729e+11

[792 rows x 5 columns]

In [48]:
df_map_oam.shape

(792, 5)

In [49]:
df_map_oam.dtypes

Year                    int64
Quarter                 int64
State                  object
Transaction_count       int64
Transaction_amount    float64
dtype: object

## map_overall_user_details

In [50]:
map_user_india = r'C:\Users\Windows 11\Downloads\pulse-master\pulse-master\data\map\user\hover\country\india'
map_user_ind_list = os.listdir(map_user_india)
map_user_ind_list.remove("state")
map_user_ind_list

['2018', '2019', '2020', '2021', '2022', '2023']

In [51]:
map_oau = {'Year':[],'Quarter':[],'State':[],'RegisteredUsers':[],'Appopens':[]}

for year in map_user_ind_list:
    cur_year = map_user_india +'/'+year + "/"
    year_trans = os.listdir(cur_year)
    
    for file in year_trans:
        cur_file = cur_year+file
        data = open(cur_file,'r')
        J = json.load(data)
#         print(J)
        
        for i in J['data']['hoverData'].items():
                state = i[0]
                users = i[1]['registeredUsers']
                appopens = i[1]['appOpens']
                map_oau['Year'].append(int(year))
                map_oau['Quarter'].append(int(file.strip('.json')))
                map_oau['State'].append(state)
                map_oau['RegisteredUsers'].append(users)
                map_oau['Appopens'].append(appopens)
        
df_map_oau = pd.DataFrame(map_oau)

In [52]:
df_map_oau

     Year  Quarter              State  RegisteredUsers   Appopens
0    2018        1         puducherry            49318          0
1    2018        1         tamil nadu          2104754          0
2    2018        1      uttar pradesh          4694250          0
3    2018        1     madhya pradesh          2553603          0
4    2018        1     andhra pradesh          3336450          0
..    ...      ...                ...              ...        ...
787  2023        2    jammu & kashmir          1953132  209249141
788  2023        2                goa           926020   20219644
789  2023        2  arunachal pradesh           426410  106089520
790  2023        2              delhi         17103089   51415039
791  2023        2        uttarakhand          4645322  240804293

[792 rows x 5 columns]

In [53]:
df_map_oau.shape

(792, 5)

In [54]:
df_map_oau.dtypes

Year                int64
Quarter             int64
State              object
RegisteredUsers     int64
Appopens            int64
dtype: object

## Top_overall_trans_details

In [55]:
top_trans_india = r'C:\Users\Windows 11\Downloads\pulse-master\pulse-master\data\top\transaction\country\india'
top_trans_ind_list = os.listdir(top_trans_india)
top_trans_ind_list.remove("state")
top_trans_ind_list

['2018', '2019', '2020', '2021', '2022', '2023']

In [56]:
top_oat = {'Year': [],'Quarter': [],'State': [],'Transaction_count': [],'Transaction_amount': []}

for year in top_trans_ind_list:
    cur_year = top_trans_india +'/'+year + "/"
    year_trans = os.listdir(cur_year)
    
    for file in year_trans:
        cur_file = cur_year+file
        data = open(cur_file,'r')
        K = json.load(data)
        
        for i in K['data']['states']:
            state = i['entityName']
            count = i['metric']['count']
            amount = i['metric']['amount']
            top_oat['Transaction_count'].append(count)
            top_oat['Transaction_amount'].append(amount)
            top_oat['State'].append(state)
            top_oat['Year'].append(int(year))
            top_oat['Quarter'].append(int(file.strip('.json')))
            
df_top_oat = pd.DataFrame(top_oat)

In [57]:
df_top_oat

     Year  Quarter           State  Transaction_count  Transaction_amount
0    2018        1     maharashtra           16387034        2.171161e+10
1    2018        1   uttar pradesh           12537805        1.393997e+10
2    2018        1       karnataka           12016899        1.921790e+10
3    2018        1     west bengal           11710225        1.062598e+10
4    2018        1  andhra pradesh            9039585        1.199628e+10
..    ...      ...             ...                ...                 ...
215  2023        2       rajasthan         1073459338        1.698456e+12
216  2023        2  madhya pradesh          848037060        1.202441e+12
217  2023        2           bihar          683933094        1.226047e+12
218  2023        2     west bengal          545317686        1.009315e+12
219  2023        2          odisha          544597829        7.993321e+11

[220 rows x 5 columns]

In [58]:
df_top_oat.shape

(220, 5)

In [59]:
df_top_oat.dtypes

Year                    int64
Quarter                 int64
State                  object
Transaction_count       int64
Transaction_amount    float64
dtype: object

## Top_overall_user_details

In [60]:
top_user_india = r'C:\Users\Windows 11\Downloads\pulse-master\pulse-master\data\top\user\country\india'
top_user_ind_list = os.listdir(top_user_india)
top_user_ind_list.remove("state")
top_user_ind_list

['2018', '2019', '2020', '2021', '2022', '2023']

In [61]:
top_oau = {'State':[],'Year':[],'Quarter':[],'RegisteredUsers':[]}

for year in top_user_ind_list:
    cur_year = top_user_india +'/'+year + "/"
    year_trans = os.listdir(cur_year)
    
    for file in year_trans:
        cur_file = cur_year+file
        data = open(cur_file,'r')
        L = json.load(data)
        
        for i in L['data']['states']:
            name = i['name']
            registeredUsers = i['registeredUsers']
            top_oau['RegisteredUsers'].append(registeredUsers)
            top_oau['State'].append(name)
            top_oau['Year'].append(int(year))
            top_oau['Quarter'].append(int(file.strip('.json')))
        
df_top_oau = pd.DataFrame(top_oau)

In [62]:
df_top_oau

              State  Year  Quarter  RegisteredUsers
0       maharashtra  2018        1          6106994
1     uttar pradesh  2018        1          4694250
2         karnataka  2018        1          3717763
3    andhra pradesh  2018        1          3336450
4         telangana  2018        1          3315560
..              ...   ...      ...              ...
215     west bengal  2023        2         27827662
216       telangana  2023        2         27814633
217      tamil nadu  2023        2         27317599
218  madhya pradesh  2023        2         25042930
219         gujarat  2023        2         24396768

[220 rows x 4 columns]

In [63]:
df_top_oau.shape

(220, 4)

In [64]:
df_top_oau.dtypes

State              object
Year                int64
Quarter             int64
RegisteredUsers     int64
dtype: object

# Connecting to mysql database for create database & stored the values

In [65]:
myconnection = pymysql.connect(host="127.0.0.1",user="root",passwd="*********")  # use your MySql password
cur = myconnection.cursor()
cur.execute("CREATE DATABASE IF NOT EXISTS PHONE_PE")

1

In [66]:
engine = create_engine('mysql+pymysql://root:*********@localhost/PHONE_PE')     # use your MySql password

#### state wise data stored in sql database with tables

In [67]:
df_agg_trans.to_sql('agg_trans',con=engine, if_exists='replace', index=False, method='multi')  # agg_trans table in sql and push the values df_agg_trans 
df_agg_user.to_sql('agg_user',con=engine, if_exists='replace', index=False, method='multi')    # agg_User table in sql and push the values df_agg_user
df_map_trans.to_sql('map_trans',con=engine, if_exists='replace', index=False, method='multi')  # map_trans table in sql and push the values df_agg_trans
df_map_user.to_sql('map_user',con=engine, if_exists='replace', index=False, method='multi')    # map_user table in sql and push the values df_map_user  
df_top_trans.to_sql('top_trans',con=engine, if_exists='replace', index=False, method='multi')  # top_trans table in sql and push the values df_top_trans
df_top_user.to_sql('top_user',con=engine, if_exists='replace', index=False, method='multi')    # top_user table in sql and push the values df_top_user

7854

#### Overall data stored in sql database with tables

In [68]:
df_agg_oat.to_sql('agg_indt',con=engine, if_exists='replace', index=False, method='multi')   # agg_indt table in sql and push the values df_agg_oat 
df_agg_oau.to_sql('agg_indu',con=engine, if_exists='replace', index=False, method='multi')   # agg_indu table in sql and push the values df_agg_oau
df_map_oam.to_sql('map_indt',con=engine, if_exists='replace', index=False, method='multi')   # map_indt table in sql and push the values df_map_oam
df_map_oau.to_sql('map_indu',con=engine, if_exists='replace', index=False, method='multi')   # map_indu table in sql and push the values df_map_oau  
df_top_oat.to_sql('top_indt',con=engine, if_exists='replace', index=False, method='multi')   # top_indt table in sql and push the values df_top_oat
df_top_oau.to_sql('top_indu',con=engine, if_exists='replace', index=False, method='multi')   # top_indu table in sql and push the values df_top_oau

220

## again connecting the mysql database with path

In [69]:
myconnection = pymysql.connect(host="127.0.0.1",user="root",passwd="*********",database="PHONE_PE")  # use your MySql password
cur = myconnection.cursor()

In [70]:
cur.execute('show tables')
ans = cur.fetchall()
table_names = [table[0] for table in ans]
print(table_names)

['agg_indt', 'agg_indu', 'agg_trans', 'agg_user', 'map_indt', 'map_indu', 'map_trans', 'map_user', 'top_indt', 'top_indu', 'top_trans', 'top_user']